{
  "title": "The Capacity for Moral Self-Correction in Large Language Models",
  "citations": [
    {
      "citation_number": "1",
      "citation": "A. Abid, M. Farooqi, and J. Zou, 2021,",
      "paper_title": "Large language models associate Muslims with violence",
      "year": "2021"
    },
    {
      "citation_number": "2",
      "citation": "A. Askell, Y. Bai, A. Chen, D. Drain, D. Ganguli, T. Henighan, A. Jones, N. Joseph, B. Mann, N. DasSarma, N. Elhage, Z. Hatfield-Dodds, D. Hernandez, J. Kernion, K. Ndousse, C. Olsson, D. Amodei, T. Brown, J. Clark, S. McCandlish, C. Olah, and J. Kaplan, 2021,",
      "paper_title": "A General Language Assistant as a Laboratory for Alignment",
      "year": "2021"
    },
    {
      "citation_number": "3",
      "citation": "Y. Bai, A. Jones, K. Ndousse, A. Askell, A. Chen, N. DasSarma, D. Drain, S. Fort, D. Ganguli, T. Henighan, N. Joseph, S. Kadavath, J. Kernion, T. Conerly, S. El-Showk, N. Elhage, Z. Hatfield-Dodds, D. Hernandez, T. Hume, S. Johnston, S. Kravec, L. Lovitt, N. Nanda, C. Olsson, D. Amodei, T. Brown, J. Clark, S. McCandlish, C. Olah, B. Mann, and J. Kaplan, 2022,",
      "paper_title": "Training a Helpful and Harmless Assistant with Reinforcement Learning from Human Feedback",
      "year": "2022"
    },
    {
      "citation_number": "4",
      "citation": "Y. Bai, S. Kadavath, S. Kundu, A. Askell, J. Kernion, A. Jones, A. Chen, A. Goldie, A. Mirhoseini, C. McKinnon, C. Chen, C. Olsson, C. Olah, D. Hernandez, D. Drain, D. Ganguli, D. Li, E. Tran-Johnson, E. Perez, J. Kerr, J. Mueller, J. Ladish, J. Landau, K. Ndousse, K. Lukosuite, L. Lovitt, M. Sellitto, N. Elhage, N. Schiefer, N. Mercado, N. DasSarma, R. Lasenby, R. Larson, S. Ringer, S. Johnston, S. Kravec, S. E. Showk, S. Fort, T. Lanham, T. Telleen-Lawton, T. Conerly, T. Henighan, T. Hume, S. R. Bowman, Z. Hatfield-Dodds, B. Mann, D. Amodei, N. Joseph, S. McCandlish, T. Brown, and J. Kaplan, 2022,",
      "paper_title": "Constitutional AI: Harmlessness from AI Feedback",
      "year": "2022"
    },
    {
      "citation_number": "5",
      "citation": "S. Barocas, M. Hardt, and A. Narayanan, 2019,",
      "paper_title": "Fairness and Machine Learning: Limitations and Opportunities",
      "year": "2019"
    },
    {
      "citation_number": "6",
      "citation": "C. Basta, M. R. Costa-jussà, and N. Casas, 2019,",
      "paper_title": "Evaluating the Underlying Gender Bias in Contextualized Word Embeddings",
      "year": "2019"
    },
    {
      "citation_number": "7",
      "citation": "E. Beeghly, 2015,",
      "paper_title": "What is a Stereotype? What is Stereotyping?",
      "year": "2015"
    },
    {
      "citation_number": "8",
      "citation": "E. M. Bender, T. Gebru, A. McMillan-Major, and S. Shmitchell, 2021,",
      "paper_title": "On the Dangers of Stochastic Parrots: Can Language Models Be Too Big?",
      "year": "2021"
    },
    {
      "citation_number": "9",
      "citation": "S. L. Blodgett, S. Barocas, H. Daumé III, and H. Wallach, 2020,",
      "paper_title": "Language (Technology) is Power: A Critical Survey of \"Bias\" in NLP",
      "year": "2020"
    },
    {
      "citation_number": "10",
      "citation": "S. L. Blodgett, G. Lopez, A. Olteanu, R. Sim, and H. Wallach, 2021,",
      "paper_title": "Stereotyping Norwegian Salmon: An Inventory of Pitfalls in Fairness Benchmark Datasets",
      "year": "2021"
    },
    {
      "citation_number": "11",
      "citation": "R. Bommasani, D. A. Hudson, E. Adeli, R. Altman, S. Arora, S. von Arx, M. S. Bernstein, J. Bohg, A. Bosselut, E. Brunskill, E. Brynjolfsson, S. Buch, D. Card, R. Castellon, N. Chatterji, A. Chen, K. Creel, J. Q. Davis, D. Demszky, C. Donahue, M. Doumbouya, E. Durmus, S. Ermon, J. Etchemendy, K. Ethayarajh, L. Fei-Fei, C. Finn, T. Gale, L. Gillespie, K. Goel, N. Goodman, S. Grossman, N. Guha, T. Hashimoto, P. Henderson, J. Hewitt, D. E. Ho, J. Hong, K. Hsu, J. Huang, T. Icard, S. Jain, D. Jurafsky, P. Kalluri, S. Karamcheti, G. Keeling, F. Khani, O. Khattab, P. W. Koh, M. Krass, R. Krishna, R. Kuditipudi, A. Kumar, F. Ladhak, M. Lee, T. Lee, J. Leskovec, I. Levent, X. L. Li, X. Li, T. Ma, A. Malik, C. D. Manning, S. Mirchandani, E. Mitchell, Z. Munyikwa, S. Nair, A. Narayan, D. Narayanan, B. Newman, A. Nie, J. C. Niebles, H. Nilforoshan, J. Nyarko, G. Ogut, L. Orr, I. Papadimitriou, J. S. Park, C. Piech, E. Portelance, C. Potts, A. Raghunathan, R. Reich, H. Ren, F. Rong, Y. Roohani, C. Ruiz, J. Ryan, C. Ré, D. Sadigh, S. Sagawa, K. Santhanam, A. Shih, K. Srinivasan, A. Tamkin, R. Taori, A. W. Thomas, F. Tramèr, R. E. Wang, W. Wang, B. Wu, J. Wu, Y. Wu, S. M. Xie, M. Yasunaga, J. You, M. Zaharia, M. Zhang, T. Zhang, X. Zhang, Y. Zhang, L. Zheng, K. Zhou, and P. Liang, 2021,",
      "paper_title": "On the Opportunities and Risks of Foundation Models",
      "year": "2021"
    },
    {
      "citation_number": "12",
      "citation": "T. Brown, B. Mann, N. Ryder, M. Subbiah, J. D. Kaplan, P. Dhariwal, A. Neelakantan, P. Shyam, G. Sastry, A. Askell, S. Agarwal, A. Herbert-Voss, G. Krueger, T. Henighan, R. Child, A. Ramesh, D. Ziegler, J. Wu, C. Winter, C. Hesse, M. Chen, E. Sigler, M. Litwin, S. Gray, B. Chess, J. Clark, C. Berner, S. McCandlish, A. Radford, I. Sutskever, and D. Amodei, 2020,",
      "paper_title": "Language Models are Few-Shot Learners",
      "year": "2020"
    },
    {
      "citation_number": "13",
      "citation": "P. F. Christiano, J. Leike, T. Brown, M. Martic, S. Legg, and D. Amodei, 2017,",
      "paper_title": "Deep Reinforcement Learning from Human Preferences",
      "year": "2017"
    },
    {
      "citation_number": "14",
      "citation": "A. Coston, A. Mishler, E. H. Kennedy, and A. Chouldechova, 2020,",
      "paper_title": "Counterfactual Risk Assessments, Evaluation, and Fairness",
      "year": "2020"
    },
    {
      "citation_number": "15",
      "citation": "E. Dinan, G. Abercrombie, A. S. Bergman, S. Spruit, D. Hovy, Y.-L. Boureau, and V. Rieser, 2021,",
      "paper_title": "Anticipating Safety Issues in E2E Conversational AI: Framework and Tooling",
      "year": "2021"
    },
    {
      "citation_number": "16",
      "citation": "C. Dwork, M. Hardt, T. Pitassi, O. Reingold, and R. Zemel, 2011,",
      "paper_title": "Fairness Through Awareness",
      "year": "2011"
    },
    {
      "citation_number": "17",
      "citation": "B. Eidelson, 2015,",
      "paper_title": "The Concept of Discrimination",
      "year": "2015"
    },
    {
      "citation_number": "18",
      "citation": "D. Ganguli, D. Hernandez, L. Lovitt, N. DasSarma, T. Henighan, A. Jones, N. Joseph, J. Kernion, B. Mann, A. Askell, Y. Bai, A. Chen, T. Conerly, D. Drain, N. Elhage, S. E. Showk, S. Fort, Z. Hatfield-Dodds, S. Johnston, S. Kravec, N. Nanda, K. Ndousse, C. Olsson, D. Amodei, D. Amodei, T. Brown, J. Kaplan, S. McCandlish, C. Olah, and J. Clark, 2022,",
      "paper_title": "Predictability and Surprise in Large Generative Models",
      "year": "2022"
    },
    {
      "citation_number": "19",
      "citation": "D. Ganguli, L. Lovitt, J. Kernion, A. Askell, Y. Bai, S. Kadavath, B. Mann, E. Perez, N. Schiefer, K. Ndousse, A. Jones, S. Bowman, A. Chen, T. Conerly, N. DasSarma, D. Drain, N. Elhage, S. El-Showk, S. Fort, Z. Hatfield-Dodds, T. Henighan, D. Hernandez, T. Hume, J. Jacobson, S. Johnston, S. Kravec, C. Olsson, S. Ringer, E. Tran-Johnson, D. Amodei, T. Brown, N. Joseph, S. McCandlish, C. Olah, J. Kaplan, and J. Clark, 2022,",
      "paper_title": "Red Teaming Language Models to Reduce Harms: Methods, Scaling Behaviors, and Lessons Learned",
      "year": "2022"
    },
    {
      "citation_number": "20",
      "citation": "S. Gehman, S. Gururangan, M. Sap, Y. Choi, and N. A. Smith, 2020,",
      "paper_title": "RealToxicityPrompts: Evaluating Neural Toxic Degeneration in Language Models",
      "year": "2020"
    },
    {
      "citation_number": "21",
      "citation": "A. Glaese, N. McAleese, M. Trębacz, J. Aslanides, V. Firoiu, T. Ewalds, M. Rauh, L. Weidinger, M. Chadwick, P. Thacker, L. Campbell-Gillingham, J. Uesato, P.-S. Huang, R. Comanescu, F. Yang, A. See, S. Dathathri, R. Greig, C. Chen, D. Fritz, J. S. Elias, R. Green, S. Mokrá, N. Fernando, B. Wu, R. Foley, S. Young, I. Gabriel, W. Isaac, J. Mellor, D. Hassabis, K. Kavukcuoglu, L. A. Hendricks, and G. Irving, 2022,",
      "paper_title": "Improving alignment of dialogue agents via targeted human judgements",
      "year": "2022"
    },
    {
      "citation_number": "22",
      "citation": "D. Hovy and S. L. Spruit, 2016,",
      "paper_title": "The Social Impact of Natural Language Processing",
      "year": "2016"
    },
    {
      "citation_number": "23",
      "citation": "P.-S. Huang, H. Zhang, R. Jiang, R. Stanforth, J. Welbl, J. Rae, V. Maini, D. Yogatama, and P. Kohli, 2019,",
      "paper_title": "Reducing Sentiment Bias in Language Models via Counterfactual Evaluation",
      "year": "2019"
    },
    {
      "citation_number": "24",
      "citation": "B. Hutchinson, V. Prabhakaran, E. Denton, K. Webster, Y. Zhong, and S. Denuyl, 2020,",
      "paper_title": "Social Biases in NLP Models as Barriers for Persons with Disabilities",
      "year": "2020"
    },
    {
      "citation_number": "25",
      "citation": "J. Kaplan, S. McCandlish, T. Henighan, T. B. Brown, B. Chess, R. Child, S. Gray, A. Radford, J. Wu, and D. Amodei, 2020,",
      "paper_title": "Scaling Laws for Neural Language Models",
      "year": "2020"
    },
    {
      "citation_number": "26",
      "citation": "A. Kasirzadeh and A. Smart, 2021,",
      "paper_title": "The Use and Misuse of Counterfactuals in Ethical Machine Learning",
      "year": "2021"
    },
    {
      "citation_number": "27",
      "citation": "P. Kim, 2022,",
      "paper_title": "Race-Aware Algorithms: Fairness, Nondiscrimination and Affirmative Action",
      "year": "2022"
    },
    {
      "citation_number": "28",
      "citation": "T. Kojima, S. S. Gu, M. Reid, Y. Matsuo, and Y. Iwasawa, 2022,",
      "paper_title": "Large Language Models are Zero-Shot Reasoners",
      "year": "2022"
    },
    {
      "citation_number": "29",
      "citation": "K. Kurita, N. Vyas, A. Pareek, A. W. Black, and Y. Tsvetkov, 2019,",
      "paper_title": "Measuring Bias in Contextualized Word Representations",
      "year": "2019"
    },
    {
      "citation_number": "30",
      "citation": "M. J. Kusner, J. Loftus, C. Russell, and R. Silva, 2017,",
      "paper_title": "Counterfactual Fairness",
      "year": "2017"
    },
    {
      "citation_number": "31",
      "citation": "K. Leins, J. H. Lau, and T. Baldwin, 2020,",
      "paper_title": "Give Me Convenience and Give Her Death: Who Should Decide What Uses of NLP are Appropriate, and on What Basis?",
      "year": "2020"
    },
    {
      "citation_number": "32",
      "citation": "T. Li, D. Khashabi, T. Khot, A. Sabharwal, and V. Srikumar, 2020,",
      "paper_title": "UNQOVERing Stereotyping Biases via Underspecified Questions",
      "year": "2020"
    },
    {
      "citation_number": "33",
      "citation": "P. Liang, R. Bommasani, T. Lee, D. Tsipras, D. Soylu, M. Yasunaga, Y. Zhang, D. Narayanan, Y. Wu, A. Kumar, B. Newman, B. Yuan, B. Yan, C. Zhang, C. Cosgrove, C. D. Manning, C. Ré, D. Acosta-Navas, D. A. Hudson, E. Zelikman, E. Durmus, F. Ladhak, F. Rong, H. Ren, H. Yao, J. Wang, K. Santhanam, L. Orr, L. Zheng, M. Yuksekgonul, M. Suzgun, N. Kim, N. Guha, N. Chatterji, O. Khattab, P. Henderson, Q. Huang, R. Chi, S. M. Xie, S. Santurkar, S. Ganguli, T. Hashimoto, T. Icard, T. Zhang, V. Chaudhary, W. Wang, X. Li, Y. Mai, Y. Zhang, and Y. Koreeda, 2022,",
      "paper_title": "Holistic Evaluation of Language Models",
      "year": "2022"
    },
    {
      "citation_number": "34",
      "citation": "Y. Liu, M. Ott, N. Goyal, J. Du, M. Joshi, D. Chen, O. Levy, M. Lewis, L. Zettlemoyer, and V. Stoyanov, 2019,",
      "paper_title": "RoBERTa: A Robustly Optimized BERT Pretraining Approach",
      "year": "2019"
    },
    {
      "citation_number": "35",
      "citation": "D. Mammonas, 2022,",
      "paper_title": "Artificial Intelligence Act: Council calls for promoting safe AI that respects fundamental rights",
      "year": "2022"
    },
    {
      "citation_number": "36",
      "citation": "N. Meade, E. Poole-Dayan, and S. Reddy, 2021,",
      "paper_title": "An Empirical Survey of the Effectiveness of Debiasing Techniques for Pre-trained Language Models",
      "year": "2021"
    },
    {
      "citation_number": "37",
      "citation": "M. Nadeem, A. Bethke, and S. Reddy, 2021,",
      "paper_title": "StereoSet: Measuring stereotypical bias in pretrained language models",
      "year": "2021"
    },
    {
      "citation_number": "38",
      "citation": "N. Nangia, C. Vania, R. Bhalerao, and S. R. Bowman, 2020,",
      "paper_title": "CrowS-Pairs: A Challenge Dataset for Measuring Social Biases in Masked Language Models",
      "year": "2020"
    },
    {
      "citation_number": "39",
      "citation": "M. Nye, A. J. Andreassen, G. Gur-Ari, H. Michalewski, J. Austin, D. Bieber, D. Dohan, A. Lewkowycz, M. Bosma, D. Luan, C. Sutton, and A. Odena, 2021,",
      "paper_title": "Show Your Work: Scratchpads for Intermediate Computation with Language Models",
      "year": "2021"
    },
    {
      "citation_number": "40",
      "citation": "A. Parrish, A. Chen, N. Nangia, V. Padmakumar, J. Phang, J. Thompson, P. M. Htut, and S. Bowman, 2022,",
      "paper_title": "BBQ: A hand-built bias benchmark for question answering",
      "year": "2022"
    },
    {
      "citation_number": "41",
      "citation": "E. Perez, S. Ringer, K. Lukošiūtė, K. Nguyen, E. Chen, S. Heiner, C. Pettit, C. Olsson, S. Kundu, S. Kadavath, A. Jones, A. Chen, B. Mann, B. Israel, B. Seethor, C. McKinnon, C. Olah, D. Yan, D. Amodei, D. Amodei, D. Drain, D. Li, E. Tran-Johnson, G. Khundadze, J. Kernion, J. Landis, J. Kerr, J. Mueller, J. Hyun, J. Landau, K. Ndousse, L. Goldberg, L. Lovitt, M. Lucas, M. Sellitto, M. Zhang, N. Kingsland, N. Elhage, N. Joseph, N. Mercado, N. DasSarma, O. Rausch, R. Larson, S. McCandlish, S. Johnston, S. Kravec, S. E. Showk, T. Lanham, T. Telleen-Lawton, T. Brown, T. Henighan, T. Hume, Y. Bai, Z. Hatfield-Dodds, J. Clark, S. R. Bowman, A. Askell, R. Grosse, D. Hernandez, D. Ganguli, E. Hubinger, N. Schiefer, and J. Kaplan, 2022,",
      "paper_title": "Discovering Language Model Behaviors with Model-Written Evaluations",
      "year": "2022"
    },
    {
      "citation_number": "42",
      "citation": "A. Radford, J. Wu, R. Child, D. Luan, D. Amodei, and I. Sutskever, 2019,",
      "paper_title": "Language Models are Unsupervised Multitask Learners",
      "year": "2019"
    },
    {
      "citation_number": "43",
      "citation": "J. W. Rae, S. Borgeaud, T. Cai, K. Millican, J. Hoffmann, F. Song, J. Aslanides, S. Henderson, R. Ring, S. Young, E. Rutherford, T. Hennigan, J. Menick, A. Cassirer, R. Powell, G. v. d. Driessche, L. A. Hendricks, M. Rauh, P.-S. Huang, A. Glaese, J. Welbl, S. Dathathri, S. Huang, J. Uesato, J. Mellor, I. Higgins, A. Creswell, N. McAleese, A. Wu, E. Elsen, S. Jayakumar, E. Buchatskaya, D. Budden, E. Sutherland, K. Simonyan, M. Paganini, L. Sifre, L. Martens, X. L. Li, A. Kuncoro, A. Nematzadeh, E. Gribovskaya, D. Donato, A. Lazaridou, A. Mensch, J.-B. Lespiau, M. Tsimpoukelli, N. Grigorev, D. Fritz, T. Sottiaux, M. Pajarskas, T. Pohlen, Z. Gong, D. Toyama, C. d. M. d'Autume, Y. Li, T. Terzi, V. Mikulik, I. Babuschkin, A. Clark, D. d. L. Casas, A. Guy, C. Jones, J. Bradbury, M. Johnson, B. Hechtman, L. Weidinger, I. Gabriel, W. Isaac, E. Lockhart, S. Osindero, L. Rimell, C. Dyer, O. Vinyals, K. Ayoub, J. Stanway, L. Bennett, D. Hassabis, K. Kavukcuoglu, and G. Irving, 2021,",
      "paper_title": "Scaling Language Models: Methods, Analysis & Insights from Training Gopher",
      "year": "2021"
    },
    {
      "citation_number": "44",
      "citation": "C. Raffel, N. Shazeer, A. Roberts, K. Lee, S. Narang, M. Matena, Y. Zhou, W. Li, and P. J. Liu, 2020,",
      "paper_title": "Exploring the Limits of Transfer Learning with a Unified Text-to-Text Transformer",
      "year": "2020"
    },
    {
      "citation_number": "45",
      "citation": "D. Raji, E. Denton, E. M. Bender, A. Hanna, and A. Paullada, 2021,",
      "paper_title": "AI and the Everything in the Whole Wide World Benchmark",
      "year": "2021"
    },
    {
      "citation_number": "46",
      "citation": "P. Rajpurkar, J. Zhang, K. Lopyrev, and P. Liang, 2016,",
      "paper_title": "SQuAD: 100,000+ Questions for Machine Comprehension of Text",
      "year": "2016"
    },
    {
      "citation_number": "47",
      "citation": "M. Rauh, J. F. J. Mellor, J. Uesato, P.-S. Huang, J. Welbl, L. Weidinger, S. Dathathri, A. Glaese, G. Irving, I. Gabriel, W. Isaac, and L. A. Hendricks, 2022,",
      "paper_title": "Characteristics of Harmful Text: Towards Rigorous Benchmarking of Language Models",
      "year": "2022"
    },
    {
      "citation_number": "48",
      "citation": "L. Rosenblatt and R. T. Witter, 2022,",
      "paper_title": "Counterfactual Fairness Is Basically Demographic Parity",
      "year": "2022"
    },
    {
      "citation_number": "49",
      "citation": "R. Rudinger, J. Naradowsky, B. Leonard, and B. V. Durme, 2018,",
      "paper_title": "Gender Bias in Coreference Resolution",
      "year": "2018"
    },
    {
      "citation_number": "50",
      "citation": "M. Sap, S. Gabriel, L. Qin, D. Jurafsky, N. A. Smith, and Y. Choi, 2020,",
      "paper_title": "Social Bias Frames: Reasoning about Social and Power Implications of Language",
      "year": "2020"
    },
    {
      "citation_number": "51",
      "citation": "T. Schick, S. Udupa, and H. Schütze, 2021,",
      "paper_title": "Self-Diagnosis and Self-Debiasing: A Proposal for Reducing Corpus-Based Bias in NLP",
      "year": "2021"
    },
    {
      "citation_number": "52",
      "citation": "J. Schulman, B. Zoph, C. Kim, J. Hilton, J. Menick, J. Weng, J. F. Ceron Uribe, L. Fedus, L. Metz, M. Pokorny, R. Gontijo Lopes, S. Zhao, A. Vijayvergiya, E. Sigler, A. Perelman, C. Voss, M. Heaton, J. Parish, D. Cummings, R. Nayak, V. Balcom, D. Schnurr, T. Kaftan, C. Hallacy, N. Turley, N. Deutsch, V. Goel, J. Ward, A. Konstantinidis, W. Zaremba, L. Ouyang, L. Bogdonoff, J. Gross, D. Medina, S. Yoo, T. Lee, R. Lowe, D. Mossing, J. Huizinga, R. Jiang, C. Wainwright, D. Almeida, S. Lin, M. Zhang, K. Xiao, K. Slama, S. Bills, A. Gray, J. Leike, J. Pachocki, P. Tillet, S. Jain, G. Brockman, N. Ryder, A. Paino, Q. Yuan, C. Winter, B. Wang, M. Bavarian, I. Babuschkin, S. Sidor, I. Kanitscheider, M. Pavlov, M. Plappert, N. Tezak, H. Jun, W. Zhuk, V. Pong, L. Kaiser, J. Tworek, A. Carr, L. Weng, S. Agarwal, K. Cobbe, V. Kosaraju, A. Power, S. Polu, J. Han, R. Puri, S. Jain, B. Chess, C. Gibson, O. Boiko, E. Parparita, A. Tootoonchian, K. Kosic, and C. Hesse, 2022,",
      "paper_title": "ChatGPT: Optimizing Language Models for Dialogue",
      "year": "2022"
    },
    {
      "citation_number": "53",
      "citation": "O. Shaikh, H. Zhang, W. Held, M. Bernstein, and D. Yang, 2022,",
      "paper_title": "On Second Thought, Let's Not Think Step by Step! Bias and Toxicity in Zero-Shot Reasoning",
      "year": "2022"
    },
    {
      "citation_number": "54",
      "citation": "C. Si, Z. Gan, Z. Yang, S. Wang, J. Wang, J. Boyd-Graber, and L. Wang, 2022,",
      "paper_title": "Prompting GPT-3 To Be Reliable",
      "year": "2022"
    },
    {
      "citation_number": "55",
      "citation": "I. Solaiman and C. Dennison, 2021,",
      "paper_title": "Process for Adapting Language Models to Society (PALMS) with Values-Targeted Datasets",
      "year": "2021"
    },
    {
      "citation_number": "56",
      "citation": "A. Srivastava, A. Rastogi, A. Rao, A. A. M. Shoeb, A. Abid, A. Fisch, A. R. Brown, A. Santoro, A. Gupta, A. Garriga-Alonso, A. Kluska, A. Lewkowycz, A. Agarwal, A. Power, A. Ray, A. Warstadt, A. W. Kocurek, A. Safaya, A. Tazarv, A. Xiang, A. Parrish, A. Nie, A. Hussain, A. Askell, A. Dsouza, A. Slone, A. Rahane, A. S. Iyer, A. Andreassen, A. Madotto, A. Santilli, A. Stuhlmüller, A. Dai, A. La, A. Lampinen, A. Zou, A. Jiang, A. Chen, A. Vuong, A. Gupta, A. Gottardi, A. Norelli, A. Venkatesh, A. Gholamidavoodi, A. Tabassum, A. Menezes, A. Kirubarajan, A. Mullokandov, A. Sabharwal, A. Herrick, A. Efrat, A. Erdem, A. Karakaş, B. R. Roberts, B. S. Loe, B. Zoph, B. Bojanowski, B. Özyurt, B. Hedayatnia, B. Neyshabur, B. Inden, B. Stein, B. Ekmekci, B. Y. Lin, B. Howald, C. Diao, C. Dour, C. Stinson, C. Argueta, C. F. Ramírez, C. Singh, C. Rathkopf, C. Meng, C. Baral, C. Wu, C. Callison-Burch, C. Waites, C. Voigt, C. D. Manning, C. Potts, C. Ramirez, C. E. Rivera, C. Siro, C. Raffel, C. Ashcraft, C. Garbacea, D. Sileo, D. Garrette, D. Hendrycks, D. Kilman, D. Roth, D. Freeman, D. Khashabi, D. Levy, D. M. González, D. Perszyk, D. Hernandez, D. Chen, D. Ippolito, D. Gilboa, D. Dohan, D. Drakard, D. Jurgens, D. Datta, D. Ganguli, D. Emelin, D. Kleyko, D. Yuret, D. Chen, D. Tam, D. Hupkes, D. Misra, D. Buzan, D. C. Mollo, D. Yang, D.-H. Lee, E. Shutova, E. D. Cubuk, E. Segal, E. Hagerman, E. Barnes, E. Donoway, E. Pavlick, E. Rodola, E. Lam, E. Chu, E. Tang, E. Erdem, E. Chang, E. A. Chi, E. Dyer, E. Jerzak, E. Kim, E. E. Manyasi, E. Zheltonozhskii, F. Xia, F. Siar, F. Martínez-Plumed, F. Happé, F. Rong, G. Mishra, G. I. Winata, G. de Melo, G. Kruszewski, G. Parascandolo, G. Mariani, G. Wang, G. Jaimovitch-López, G. Betz, G. Gur-Ari, H. Galijasevic, H. Kim, H. Rashkin, H. Hajishirzi, H. Mehta, H. Bogar, H. Shevlin, H. Schütze, H. Yakura, H. Zhang, H. M. Wong, I. Ng, I. Noble, J. Jumelet, J. Geissinger, J. Kernion, J. Hilton, J. Lee, J. F. Fisac, J. B. Simon, J. Koppel, J. Zheng, J. Zou, J. Kocoń, J. Thompson, J. Kaplan, J. Radom, J. Sohl-Dickstein, J. Phang, J. Wei, J. Yosinski, J. Novikova, J. Bosscher, J. Marsh, J. Kim, J. Taal, J. Engel, J. Alabi, J. Xu, J. Song, J. Tang, J. Waweru, J. Burden, J. Miller, J. U. Balis, J. Berant, J. Frohberg, J. Rozen, J. Hernandez-Orallo, J. Boudeman, J. Jones, J. B. Tenenbaum, J. S. Rule, J. Chua, K. Kanclerz, K. Livescu, K. Krauth, K. Gopalakrishnan, K. Ignatyeva, K. Markert, K. D. Dhole, K. Gimpel, K. Omondi, K. Mathewson, K. Chiafullo, K. Shkaruta, K. Shridhar, K. McDonell, K. Richardson, L. Reynolds, L. Gao, L. Zhang, L. Dugan, L. Qin, L. Contreras-Ochando, L.-P. Morency, L. Moschella, L. Lam, L. Noble, L. Schmidt, L. He, L. O. Colón, L. Metz, L. K. Şenel, M. Bosma, M. Sap, M. ter Hoeve, M. Farooqi, M. Faruqui, M. Mazeika, M. Baturan, M. Marelli, M. Maru, M. J. R. Quintana, M. Tolkiehn, M. Giulianelli, M. Lewis, M. Potthast, M. L. Leavitt, M. Hagen, M. Schubert, M. O. Baitemirova, M. Arnaud, M. McElrath, M. A. Yee, M. Cohen, M. Gu, M. Ivanitskiy, M. Starritt, M. Strube, M. Swędrowski, M. Bevilacqua, M. Yasunaga, M. Kale, M. Cain, M. Xu, M. Suzgun, M. Tiwari, M. Bansal, M. Aminnaseri, M. Geva, M. Gheini, M. V. T, N. Peng, N. Chi, N. Lee, N. G.A. Krakover, N. Cameron, N. Roberts, N. Doiron, N. Nangia, N. Deckers, N. Muennighoff, N. S. Keskar, N. S. Iyer, N. Constant, N. Fiedel, N. Wen, O. Zhang, O. Agha, O. Elbaghdadi, O. Levy, O. Evans, P. A. M. Casares, P. Doshi, P. Fung, P. P. Liang, P. Vicol, P. Alipoormolabashi, P. Liao, P. Liang, P. Chang, P. Eckersley, P. M. Htut, P. Hwang, P. Miłkowski, P. Patil, P. Pezeshkpour, P. Oli, Q. Mei, Q. Lyu, Q. Chen, R. Banjade, R. E. Rudolph, R. Gabriel, R. Habacker, R. R. Delgado, R. Millière, R. Garg, R. Barnes, R. A. Saurous, R. Arakawa, R. Raymaekers, R. Frank, R. Sikand, R. Novak, R. Sitelew, R. LeBras, R. Liu, R. Jacobs, R. Zhang, R. Salakhutdinov, R. Chi, R. Lee, R. Stovall, R. Teehan, R. Yang, S. Singh, S. M. Mohammad, S. Anand, S. Dillavou, S. Shleifer, S. Wiseman, S. Gruetter, S. R. Bowman, S. S. Schoenholz, S. Han, S. Kwatra, S. A. Rous, S. Ghazarian, S. Ghosh, S. Casey, S. Bischoff, S. Gehrmann, S. Schuster, S. Sadeghi, S. Hamdan, S. Zhou, S. Srivastava, S. Shi, S. Singh, S. Asaadi, S. S. Gu, S. Pachchigar, S. Toshniwal, S. Upadhyay, Shyamolima, Debnath, S. Shakeri, S. Thormeyer, S. Melzi, S. Reddy, S. P. Makini, S.-H. Lee, S. Torene, S. Hatwar, S. Dehaene, S. Divic, S. Ermon, S. Biderman, S. Lin, S. Prasad, S. T. Piantadosi, S. M. Shieber, S. Misherghi, S. Kiritchenko, S. Mishra, T. Linzen, T. Schuster, T. Li, T. Yu, T. Ali, T. Hashimoto, T.-L. Wu, T. Desbordes, T. Rothschild, T. Phan, T. Wang, T. Nkinyili, T. Schick, T. Kornev, T. Telleen-Lawton, T. Tunduny, T. Gerstenberg, T. Chang, T. Neeraj, T. Khot, T. Shultz, U. Shaham, V. Misra, V. Demberg, V. Nyamai, V. Raunak, V. Ramasesh, V. U. Prabhu, V. Padmakumar, V. Srikumar, W. Fedus, W. Saunders, W. Zhang, W. Vossen, X. Ren, X. Tong, X. Zhao, X. Wu, X. Shen, Y. Yaghoobzadeh, Y. Lakretz, Y. Song, Y. Bahri, Y. Choi, Y. Yang, Y. Hao, Y. Chen, Y. Belinkov, Y. Hou, Y. Hou, Y. Bai, Z. Seid, Z. Zhao, Z. Wang, Z. J. Wang, Z. Wang, and Z. Wu, 2022,",
      "paper_title": "Beyond the Imitation Game: Quantifying and extrapolating the capabilities of language models",
      "year": "2022"
    },
    {
      "citation_number": "57",
      "citation": "N. Stiennon, L. Ouyang, J. Wu, D. M. Ziegler, R. Lowe, C. Voss, A. Radford, D. Amodei, and P. Christiano, 2020,",
      "paper_title": "Learning to summarize from human feedback",
      "year": "2020"
    },
    {
      "citation_number": "58",
      "citation": "M. Suzgun, N. Scales, N. Schärli, S. Gehrmann, Y. Tay, H. W. Chung, A. Chowdhery, Q. V. Le, E. H. Chi, D. Zhou, and J. Wei, 2022,",
      "paper_title": "Challenging BIG-Bench Tasks and Whether Chain-of-Thought Can Solve Them",
      "year": "2022"
    },
    {
      "citation_number": "59",
      "citation": "J. Wei, Y. Tay, R. Bommasani, C. Raffel, B. Zoph, S. Borgeaud, D. Yogatama, M. Bosma, D. Zhou, D. Metzler, E. H. Chi, T. Hashimoto, O. Vinyals, P. Liang, J. Dean, and W. Fedus, 2022,",
      "paper_title": "Emergent Abilities of Large Language Models",
      "year": "2022"
    },
    {
      "citation_number": "60",
      "citation": "J. Wei, Y. Tay, and Q. V. Le, 2022,",
      "paper_title": "Inverse scaling can become U-shaped",
      "year": "2022"
    },
    {
      "citation_number": "61",
      "citation": "J. Wei, X. Wang, D. Schuurmans, M. Bosma, B. Ichter, F. Xia, E. Chi, Q. Le, and D. Zhou, 2022,",
      "paper_title": "Chain of Thought Prompting Elicits Reasoning in Large Language Models",
      "year": "2022"
    },
    {
      "citation_number": "62",
      "citation": "L. Weidinger, J. Mellor, M. Rauh, C. Griffin, J. Uesato, P.-S. Huang, M. Cheng, M. Glaese, B. Balle, A. Kasirzadeh, Z. Kenton, S. Brown, W. Hawkins, T. Stepleton, C. Biles, A. Birhane, J. Haas, L. Rimell, L. A. Hendricks, W. Isaac, S. Legassick, G. Irving, and I. Gabriel, 2021,",
      "paper_title": "Ethical and social risks of harm from Language Models",
      "year": "2021"
    },
    {
      "citation_number": "63",
      "citation": "L. F. Wightman, 1998,",
      "paper_title": "LSAC National Longitudinal Bar Passage Study",
      "year": "1998"
    },
    {
      "citation_number": "64",
      "citation": "J. Zhao, D. Khashabi, T. Khot, A. Sabharwal, and K.-W. Chang, 2021,",
      "paper_title": "Ethical-Advice Taker: Do Language Models Understand Natural Language Interventions?",
      "year": "2021"
    },
    {
      "citation_number": "65",
      "citation": "J. Zhao, T. Wang, M. Yatskar, V. Ordonez, and K.-W. Chang, 2018,",
      "paper_title": "Gender Bias in Coreference Resolution: Evaluation and Debiasing Methods",
      "year": "2018"
    }
  ]
}
